<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"698348465acb3913dfa7dac1c6201bbfca685b5dc478d9d215bb7e81a5a95d69","plan_job_ref":"Job Test terraform-refresh #48 at https://github.com/dflook/terraform-github-actions/actions/runs/15363039457","plan_out_hash":"1de9c9b0505e42f0d6136eae0d2ca1f10bb6e0e0138d288aaab4168048b41448","plan_hash":"63ac4d2b6b7661356edcfe8a5533d10c50d6502c968c8f65669ad661d3fdc255","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #48](https://github.com/dflook/terraform-github-actions/actions/runs/15363039457)